Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 73, 73, 64)        1792      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 36, 36, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 36, 36, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 34, 34, 128)       73856     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 17, 17, 128)       0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 17, 17, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 15, 15, 128)       147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 5, 64)          73792     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               131584    
_________________________________________________________________
activation_1 (Activation)    (None, 512)               0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
_________________________________________________________________
activation_2 (Activation)    (None, 256)               0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 257       
_________________________________________________________________
activation_3 (Activation)    (None, 1)                 0         
=================================================================
Total params: 560,193
Trainable params: 560,193
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
1442/1442 [==============================] - 31s - loss: 0.7721 - acc: 0.6172    - ETA: 
Epoch 2/10
1442/1442 [==============================] - 32s - loss: 0.5284 - acc: 0.7330    
Epoch 3/10
1442/1442 [==============================] - 30s - loss: 0.4793 - acc: 0.7517    
Epoch 4/10
1442/1442 [==============================] - 29s - loss: 0.5353 - acc: 0.7094    - 
Epoch 5/10
1442/1442 [==============================] - 31s - loss: 0.4734 - acc: 0.7705    
Epoch 6/10
1442/1442 [==============================] - 31s - loss: 0.4588 - acc: 0.7795    
Epoch 7/10
1442/1442 [==============================] - 31s - loss: 0.4295 - acc: 0.8037    
Epoch 8/10
1442/1442 [==============================] - 32s - loss: 0.4614 - acc: 0.7788    
Epoch 9/10
1442/1442 [==============================] - 31s - loss: 0.4083 - acc: 0.8044    
Epoch 10/10
1442/1442 [==============================] - 31s - loss: 0.4371 - acc: 0.7760    
160/162 [============================>.] - ETA: 0s_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 73, 73, 64)        1792      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 36, 36, 64)        0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 36, 36, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 34, 34, 128)       73856     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 17, 17, 128)       0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 17, 17, 128)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 15, 15, 128)       147584    
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 7, 7, 128)         0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 5, 5, 64)          73792     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 2, 2, 64)          0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 512)               131584    
_________________________________________________________________
activation_4 (Activation)    (None, 512)               0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 256)               131328    
_________________________________________________________________
activation_5 (Activation)    (None, 256)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 257       
_________________________________________________________________
activation_6 (Activation)    (None, 1)                 0         
=================================================================
Total params: 560,193
Trainable params: 560,193
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
1443/1443 [==============================] - 30s - loss: 7.5196 - acc: 0.5301    
Epoch 2/10
1443/1443 [==============================] - 30s - loss: 7.5620 - acc: 0.5308    
Epoch 3/10
1443/1443 [==============================] - 29s - loss: 7.5620 - acc: 0.5308    
Epoch 4/10
1443/1443 [==============================] - 31s - loss: 7.5620 - acc: 0.5308    
Epoch 5/10
1443/1443 [==============================] - 31s - loss: 7.5620 - acc: 0.5308    
Epoch 6/10
1443/1443 [==============================] - 30s - loss: 7.5620 - acc: 0.5308    
Epoch 7/10
1443/1443 [==============================] - 29s - loss: 7.5620 - acc: 0.5308    
Epoch 8/10
1443/1443 [==============================] - 29s - loss: 7.5620 - acc: 0.5308    
Epoch 9/10
1443/1443 [==============================] - 30s - loss: 7.5620 - acc: 0.5308    
Epoch 10/10
1443/1443 [==============================] - 29s - loss: 7.5620 - acc: 0.5308    
160/161 [============================>.] - ETA: 0s_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 73, 73, 64)        1792      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 36, 36, 64)        0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 36, 36, 64)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 34, 34, 128)       73856     
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 17, 17, 128)       0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 17, 17, 128)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 15, 15, 128)       147584    
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 7, 7, 128)         0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 5, 5, 64)          73792     
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 2, 2, 64)          0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 512)               131584    
_________________________________________________________________
activation_7 (Activation)    (None, 512)               0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               131328    
_________________________________________________________________
activation_8 (Activation)    (None, 256)               0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 257       
_________________________________________________________________
activation_9 (Activation)    (None, 1)                 0         
=================================================================
Total params: 560,193
Trainable params: 560,193
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
1443/1443 [==============================] - 29s - loss: 1.3088 - acc: 0.5793    
Epoch 2/10
1443/1443 [==============================] - 28s - loss: 0.5508 - acc: 0.7186    
Epoch 3/10
1443/1443 [==============================] - 29s - loss: 0.4836 - acc: 0.7498    
Epoch 4/10
1443/1443 [==============================] - 29s - loss: 0.4627 - acc: 0.7762    - ETA: 0s - loss: 0.4644 - acc: 0.
Epoch 5/10
1443/1443 [==============================] - 29s - loss: 0.4370 - acc: 0.7949    
Epoch 6/10
1443/1443 [==============================] - 29s - loss: 0.4298 - acc: 0.7879    
Epoch 7/10
1443/1443 [==============================] - 31s - loss: 0.4132 - acc: 0.7990    - ETA: 2s - loss: 0.4171 -
Epoch 8/10
1443/1443 [==============================] - 29s - loss: 0.3983 - acc: 0.8191    
Epoch 9/10
1443/1443 [==============================] - 29s - loss: 0.3808 - acc: 0.8177    
Epoch 10/10
1443/1443 [==============================] - 27s - loss: 0.3438 - acc: 0.8399    
160/161 [============================>.] - ETA: 0s_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_13 (Conv2D)           (None, 73, 73, 64)        1792      
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 36, 36, 64)        0         
_________________________________________________________________
dropout_19 (Dropout)         (None, 36, 36, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 34, 34, 128)       73856     
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 17, 17, 128)       0         
_________________________________________________________________
dropout_20 (Dropout)         (None, 17, 17, 128)       0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 15, 15, 128)       147584    
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 7, 7, 128)         0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 5, 5, 64)          73792     
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 2, 2, 64)          0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 512)               131584    
_________________________________________________________________
activation_10 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_23 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 256)               131328    
_________________________________________________________________
activation_11 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_24 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_12 (Activation)   (None, 1)                 0         
=================================================================
Total params: 560,193
Trainable params: 560,193
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
1444/1444 [==============================] - 29s - loss: 7.5116 - acc: 0.5298    
Epoch 2/10
1444/1444 [==============================] - 28s - loss: 7.5679 - acc: 0.5305    
Epoch 3/10
1444/1444 [==============================] - 28s - loss: 7.5679 - acc: 0.5305    - ETA: 1s - loss: 7.5372 - acc: 
Epoch 4/10
1444/1444 [==============================] - 28s - loss: 7.5679 - acc: 0.5305    
Epoch 5/10
1444/1444 [==============================] - 28s - loss: 7.5679 - acc: 0.5305    
Epoch 6/10
1444/1444 [==============================] - 28s - loss: 7.5679 - acc: 0.5305    
Epoch 7/10
1444/1444 [==============================] - 29s - loss: 7.5679 - acc: 0.5305    
Epoch 8/10
1444/1444 [==============================] - 30s - loss: 7.5679 - acc: 0.5305    
Epoch 9/10
1444/1444 [==============================] - 29s - loss: 7.5679 - acc: 0.5305    - ETA: 1s - loss: 7.6120 - acc
Epoch 10/10
1444/1444 [==============================] - 29s - loss: 7.5679 - acc: 0.5305    
160/160 [==============================] - 1s     
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 73, 73, 64)        1792      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 36, 36, 64)        0         
_________________________________________________________________
dropout_25 (Dropout)         (None, 36, 36, 64)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 34, 34, 128)       73856     
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 17, 17, 128)       0         
_________________________________________________________________
dropout_26 (Dropout)         (None, 17, 17, 128)       0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 15, 15, 128)       147584    
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 7, 7, 128)         0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 5, 5, 64)          73792     
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 2, 2, 64)          0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 512)               131584    
_________________________________________________________________
activation_13 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 256)               131328    
_________________________________________________________________
activation_14 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_30 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_15 (Activation)   (None, 1)                 0         
=================================================================
Total params: 560,193
Trainable params: 560,193
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
1444/1444 [==============================] - 30s - loss: 0.8571 - acc: 0.5880    
Epoch 2/10
1444/1444 [==============================] - 30s - loss: 0.5181 - acc: 0.7181    
Epoch 3/10
1444/1444 [==============================] - 28s - loss: 0.4739 - acc: 0.7583    
Epoch 4/10
1444/1444 [==============================] - 28s - loss: 0.4694 - acc: 0.7680    - ETA: 5
Epoch 5/10
1444/1444 [==============================] - 28s - loss: 0.4714 - acc: 0.7791    
Epoch 6/10
1444/1444 [==============================] - 28s - loss: 0.4255 - acc: 0.7957    
Epoch 7/10
1444/1444 [==============================] - 28s - loss: 0.4540 - acc: 0.7659    
Epoch 8/10
1444/1444 [==============================] - 28s - loss: 0.4059 - acc: 0.8096    
Epoch 9/10
1444/1444 [==============================] - 28s - loss: 0.3721 - acc: 0.8317    
Epoch 10/10
1444/1444 [==============================] - 28s - loss: 0.3818 - acc: 0.8179    
160/160 [==============================] - 0s     